Revit 2025 API
WorksetDefaultVisibilitySettings.SetWorksetVisibility Method
 Set the default visibility of a workset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public void SetWorksetVisibility(
	WorksetId worksetId,
	bool visible
)
Public Sub SetWorksetVisibility (
	worksetId As WorksetId,
	visible As Boolean
)
public:
void SetWorksetVisibility(
	WorksetId^ worksetId,
	bool visible
)
member SetWorksetVisibility :
        worksetId : WorksetId *
        visible : bool -> unit
Parameters
worksetId WorksetId
 Id of the workset.
visible Boolean
 Whether the workset should be visible by default or not.
Exceptions
Exception | Condition
ArgumentException |  There is no workset with this Id in the document.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  WorksetDefaultVisibilitySettings is not applicable to family documents.
Example
public void HideWorkset(Document doc, View view, WorksetId worksetId)
{
    // get the current visibility
    WorksetVisibility visibility = view.GetWorksetVisibility(worksetId);
    // and set it to 'Hidden' if it is not hidden yet
    if (visibility != WorksetVisibility.Hidden)
    {
        view.SetWorksetVisibility(worksetId, WorksetVisibility.Hidden);
    }
    // Get the workset’s default visibility
    WorksetDefaultVisibilitySettings defaultVisibility = WorksetDefaultVisibilitySettings.GetWorksetDefaultVisibilitySettings(doc);
    // and making sure it is set to 'false'
    if (defaultVisibility.IsWorksetVisible(worksetId))
    {
        defaultVisibility.SetWorksetVisibility(worksetId, false);
    }
}
Public Sub HideWorkset(doc As Document, view As View, worksetId As WorksetId)
    ' get the current visibility
    Dim visibility As WorksetVisibility = view.GetWorksetVisibility(worksetId)
    ' and set it to 'Hidden' if it is not hidden yet
    If visibility <> WorksetVisibility.Hidden Then
        view.SetWorksetVisibility(worksetId, WorksetVisibility.Hidden)
    End If
    ' Get the workset’s default visibility
    Dim defaultVisibility As WorksetDefaultVisibilitySettings = WorksetDefaultVisibilitySettings.GetWorksetDefaultVisibilitySettings(doc)
    ' and making sure it is set to 'false'
    If defaultVisibility.IsWorksetVisible(worksetId) Then
        defaultVisibility.SetWorksetVisibility(worksetId, False)
    End If
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
WorksetDefaultVisibilitySettings Class
Autodesk.Revit.DB Namespace